---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterIterator.MoveNext
source: html/e3feedea-af93-c201-b0a7-03c1a2d0b16a.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.